package cc.aoeiuv020.panovel.api.site

import org.junit.Test

/**
 *
 * Created by AoEiuV020 on 2017.10.08-21:52:04.
 */
class BiqugeseTest : BaseNovelContextText(Biqugese::class) {
    @Test
    fun search() {
        search("都市")
        search("系统和我不匹配", "此梦当醒", "67191")
    }

    @Test
    fun detail() {
        detail("67191", "67191", "系统和我不匹配", "此梦当醒",
                "http://www.biquxs520.com/cover/20200830/31c621903ffe48a3c8919934bb35ee83.jpg",
                "通俗版：穿越了，带着游戏《神尊》中的最强剑士账号，但想象中的平推异世界却没有发生，毕竟游戏角色【极恶·至善·漆黑之光】跟我吴羽又有什么关系呢！\n" +
                        "“狗系统，你倒是把属性点加到我的本体上面啊！”此乃吴羽每晚都会发出的绝望咆哮。\n" +
                        "正式版：每一个世界都是用来封印神明的囚笼，而凡人们更愿意称那位神明为魔王，只因祂突破封印的方法被我们称之为——灭世。\n" +
                        "ps：其实这就是某条咸鱼费尽心思重塑自己左手的故事。",
                "2021-01-02 00:00:00")
    }

    @Test
    fun chapters() {
        chapters("67191", "第1章我和狗系统的初遇", "67191/75496627", null,
                "第20章不变的初衷", "67191/80104630", "2021-01-02 00:00:00",
                164)
    }

    @Test
    fun content() {
        content("67191/78029901",
                "在光明教会的地下，存在着许多不为人知的密室，而其中有一处，则是只有历代教皇才能够出入的禁地。",
                "“还跟我装傻呢？”吴羽也懒得继续都圈子了，直接说道“那我问你，你把菲尔利斯卖给那群强盗，你到底收了他们多少好处费啊？”",
                91)
    }
}