package cc.aoeiuv020.panovel.api.site

import org.junit.Test

/**
 * Created by AoEiuV020 on 2018.06.06-18:51:31.
 */
class Bqg5200Test : BaseNovelContextText(Bqg5200::class) {
    @Test
    fun search() {
        search("都市")
        search("狂武战帝", "被罚站的豆豆", "2889")
        search("龙王传说", "唐家三少", "3590")
    }

    @Test
    fun detail() {
        detail("2889", "2889", "狂武战帝", "被罚站的豆豆",
                "https://www.bqg5200.com/files/article/image/2/2889/2889s.jpg",
                "若这山河不在，要我残躯何用？",
                "2017-10-25 00:00:00")
        detail("3590", "3590", "龙王传说", "唐家三少",
                "https://www.bqg5200.com/files/article/image/3/3590/3590s.jpg",
                "伴随着魂导科技的进步，斗罗大陆上的人类征服了海洋，又发现了两片大陆。" +
                        "魂兽也随着人类魂师的猎杀无度走向灭亡，" +
                        "沉睡无数年的魂兽之王在星斗大森林最后的净土苏醒，" +
                        "它要带领仅存的族人，向人类复仇！\n" +
                        "唐舞麟立志要成为一名强大的魂师，可当武魂觉醒时，苏醒的，却是……\n" +
                        "旷世之才，龙王之争，我们的龙...",
                "2018-06-06 00:00:00")
    }

    @Test
    fun chapters() {
        chapters("2889", "第1章 来世怎不杀尽尔等", "2/2889/1633793", null,
                "第3106章 恢复实力！", "2/2889/6078614", "2017-10-25 14:02:00",
                3129)
        chapters("3590", "楔子", "3/3590/2054491", null,
                "第一千八百二十二章 第六考", "3/3590/11768349", "2018-06-06 07:17:00",
                1828)
    }

    @Test
    fun content() {
        content("2/2889/1633793",
                "星河浩瀚，强者移山填海弹指间，挥手朽木逢春，脚踏星辰，震溃千里，一缕缕星辉倾洒万世，不断有恒星破碎，大火焚尽诸天。",
                "虚空撕裂，一道执念不死，带着滔天怨力卷入黑洞，随着金光消失的无影无踪。",
                52)
        content("3/3590/11768349",
                "此时的积累更像是压缩，对于精神力的压缩，而这份压缩过程中，就让唐舞麟自身的精神层次在压迫中缓缓有了一些升华的感觉。",
                "求月票、推荐票。",
                50)
    }

}