package cc.aoeiuv020.panovel.api.site

import org.junit.Test

/**
 * Created by AoEiuV020 on 2018.06.06-12:44:03.
 */
class ExiaoshuoTest : BaseNovelContextText(Exiaoshuo::class) {
    @Test
    fun search() {
        search("都市")
        search("凡人修仙之仙界篇", "忘语", "1273")
        search("史上最强店主", "南极烈日", "159")
    }

    @Test
    fun detail() {
        detail("1273", "1273", "凡人修仙之仙界篇", "忘语",
                "https://www.exiaoshuo.cc/uploadfile/1/1273/1273s.jpg",
                "凡人修仙，风云再起时空穿梭，轮回逆转金仙太乙，大罗道祖三千大道，" +
                        "法则至尊《凡人修仙传》仙界篇，一个韩立叱咤仙界的故事，一个凡人小子修仙的不灭传说。",
                "2018-06-06 00:00:00")
        detail("159", "159", "史上最强店主", "南极烈日",
                "https://www.exiaoshuo.cc/uploadfile/0/159/159s.jpg",
                "商通万界，让所有人给我打工。周阳意外获得万界商铺系统，交易万千位面。" +
                        "“我曾举行一次小型拍卖会，来到的皇帝就有一百多位，听说还有两个叫李世民的皇帝。”“",
                "2017-06-02 00:00:00")
    }

    @Test
    fun chapters() {
        chapters("1273", "仙界篇外传一", "1/1273/556921", null,
                "第三百一十七章 天蝎令", "1/1273/1095554", null,
                324)
        chapters("159", "1.第1章 万界商铺系统", "0/159/136114", null,
                "853.第845章 三界房地产公司引起的变化", "0/159/288682", null,
                854)
    }

    @Test
    fun content() {
        content("0/159/136114",
                "天空湛蓝，大日悬空，烈日炎炎。",
                "看着房间内的两人，周阳心中忍不住一阵惊呼。",
                64)
        content("1/1273/1095554",
                "祁良上前几步，翻手取出一枚白色令牌，上面雕刻了一个蝎子形状的图案，散发出淡淡的白色莹光。",
                "两人此番暗斗虽然隐秘，但在场众人都是真仙修士，自然不会感觉不到，脸上都露出诧异之色。",
                80)
    }

}