package cc.aoeiuv020.panovel.api.site

import org.junit.Test

/**
 * Created by AoEiuV020 on 2018.06.03-18:17:22.
 */
class GuanshuwangTest : BaseNovelContextText(Guanshuwang::class) {
    @Test
    fun search() {
        search("都市")
        search("剑来", "烽火戏诸侯", "86/86047")
        search("天道图书馆", "横扫天涯", "86/86950")
    }

    @Test
    fun detail() {
        detail("86/86047", "86/86047", "剑来", "烽火戏诸侯",
                "https://www.biyuwu.cc/coverimages/86/86047/86047s.jpg",
                "大千世界，无奇不有。" +
                        "我陈平安，唯有一剑，可搬山，倒海，降妖，镇魔，敕神，摘星，断江，摧城，开天！",
                "2018-06-01 23:59:55")
    }

    @Test
    fun chapters() {
        chapters("86/86047", "新书感言", "86/86047/2336", null,
                "第三百一十一章 人外有人", "86/86047/1110517", "2018-06-01 23:59:55",
                313)
    }

    @Test
    fun content() {
        content("86/86047/2336",
                "新书的重心在于“构建一个光怪陆离却合理有趣的仙侠世界”，对于一个崭新世界基础构建，" +
                        "即人与精怪鬼魅如何共处人间，会比较花力气和心思。当然，“传统”仙侠的套路，也会有，也是必然是不可或缺的。",
                "新书框架很大，写的时候会越来越大，但我有信心把那个世界写得有意思，也会很注重故事和人物之间的平衡，" +
                        "“珠子以线串成珠帘”，琳琅满目，毕竟是一件很美好的事物。世间好物不坚牢，彩云易散琉璃脆。那咱们就从小说里找补回来，多好。",
                6)
    }

}