package cc.aoeiuv020.panovel.api.site

import org.junit.Test

class KenshuzwTest : BaseNovelContextText(Kenshuzw::class) {
    @Test
    fun search() {
        search("都市")
        search("桃运神医混都市", "一念", "44805")
        search("柯学捡尸人", "仙舟", "185033")
    }

    @Test
    fun detail() {
        detail(
            "44805", "44805", "桃运神医混都市", "一念",
            "http://api.kenshuzw.com/44/44805/44805s.jpg",
            "实习医生叶正豪，意外的得到一本古书上的玄术与医道传承，自此开始了不一样的人生，他银针渡人，术法渡鬼，成就济世仁心，医道问卜、风水勘舆无所不精。且看主角如何弘扬华",
            "2021-09-15 00:00:00"
        )
        detail(
            "185033", "185033", "柯学捡尸人", "仙舟",
            "http://api.kenshuzw.com/185/185033/185033s.jpg",
            "大佬A苦口婆心：\n“你才18，人生还很长。”\n大佬B语重心长：\n“这天赋，不走正道可惜了。”\n大佬C忧心忡忡：\n“离开组织吧，你不该站在黑暗里。”\n………………\n江夏“嗯”、“是”、“您说得对”应付三连，收下被发的第N张“你本来应该是个好人”卡，心累的叹了一口气。\n.\n他明明是个心理健康、成绩优异、有理想有抱负的大好青年。\n……可是为什么所有人都在劝他改邪归正。\n===================\n马甲流，半无敌，轻松日常~",
            "2021-09-19 00:00:00"
        )
    }

    @Test
    fun chapters() {
        chapters(
            "44805", "第1章 实习生", "44805/24882082", null,
            "第4358章 你有优势", "44805/89904689", "2021-09-15 00:00:00",
            4341
        )
        chapters(
            "185033", "第1章 你不要多想", "185033/84973589", null,
            "第577章 基德：想扮成江夏.jpg 求月票(⑅˃◡˂⑅)", "185033/89971562", "2021-09-19 00:00:00",
            610
        )
    }

    @Test
    fun content() {
        content(
            "44805/89904689",
            "“这确实是你的弱点，但是你要清楚，龙后这些年嚣张跋扈，得罪了不少人，而且龙皇早已经厌倦她了，她之所以现在还立于不败之地，大概就是她背后的水巨蛇一族了。”叶皓轩淡淡的说。",
            "“那就好，叶皓轩……”郁妃怔了良久，她微微的叹了一口气道：“说真的，这个龙府之中，这些年能让我信任的人不多，我不知道为什么我会对你如此信任。”",
            25
        )
        content(
            "185033/89971562",
            "一小时后。",
            "7017k",
            65
        )
    }

}