package cc.aoeiuv020.panovel.api.site

import org.junit.Test

class KsswTest : BaseNovelContextText(Kssw::class) {
    @Test
    fun search() {
        search("都市")
        search("我真不是邪神走狗", "万劫火", "2588")
    }

    @Test
    fun detail() {
        detail(
            "2588", "2588", "我真不是邪神走狗", "万劫火",
            "https://pc.kssw.net/files/article/image/2/2588/2588s.jpg",
            "",
            "2020-10-07 01:19:00"
        )
    }

    @Test
    fun chapters() {
        chapters(
            "2588", "001-欢迎光临", "2588/21098411", null,
            "255-“季”与A16庄园（第三更）", "2588/24265713", "2020-10-07 01:19:00",
            257
        )
    }

    @Test
    fun content() {
        content(
            "2588/24265713",
            "就在胡德与安德曾两人在哲罗姆办么室当中，商量着怎么把自家基地连锅端的时候。另一边，同在中央区的a16号住宅之中，此刻却发生了一件或许将要改变-些什么的事情。a16号住宅，姓季",
            "费很够，但是你再不去书店拜访，别人就都把羹分完了。季博农把那份文件拿过来翻了翻，心里-惊，眉头皱“这次真理会?”wuhl他的目光不由得移到了桌子的右上角，那里同样也有一模一样类型的纸质文件记录了每一次不同组织、个人和书店的接触，以及各自的结果。最近的一份情报，还是关于太阳神教的建立。在那之前，季博农依靠的还是自己的情报网，但是现在，女儿情报却比自己还要先了",
            10
        )
    }
}