package cc.aoeiuv020.panovel.api.site

import org.junit.Test

/**
 * Created by AoEiuV020 on 2018.06.06-19:25:28.
 */
class Lewen123Test : BaseNovelContextText(Lewen123::class) {
    @Test
    fun search() {
        search("都市")
        search("极品女仙", "金铃动", "3460")
        search("穿越之变身绝色女主角", "饥饿的蚊子", "72302")
    }

    @Test
    fun detail() {
        detail("3460", "3460", "极品女仙", "金铃动",
                "http://www.lewen123.com/files/article/image/3/3460/3460s.jpg",
                "一个现代女来到了一个陌生的世界，附身在一个被家族抛弃的家庭中。却因得到丹符宗的传承，踏上修仙路。本书很爽，很腹黑，很……，你懂的！\n" +
                        "铃动天下书友群（1）：1·6·5·4·2·8·7·8·9（已满）\n" +
                        "铃动天下书友群（2）：1·4·3·9·2·5·8·1·1（已满）\n" +
                        "铃动天下书友群（vip铁杆群）：2·0·7·0·2·9·0·9·6（入群需要验证全订截图）\n" +
                        "...",
                "2016-01-08 00:00:00")
        detail("72302", "72302", "穿越之变身绝色女主角", "饥饿的蚊子",
                "http://www.lewen123.com/files/article/image/72/72302/72302s.jpg",
                "消炎每天最怕的就是醒来，因为睡醒之后他不知道自己又将变成那部影视动漫作品里的绝色女主角…还记得第一次变身是《神雕侠侣》里的小龙女",
                "2018-06-06 00:00:00")
    }

    @Test
    fun chapters() {
        chapters("3460", "第一章 庄生梦蝶", "3/3460/1436311", null,
                "新书《极品飞仙》", "3/3460/12825541", null,
                3413)
        // 这网站章节有大量重复，
        chapters("72302", "第一章 穿越变身小龙女", "72/72302/16412419", null,
                "第1438章 再次见到【白】", "72/72302/20764594", null,
                1437)
    }

    @Test
    fun content() {
        content("3/3460/1436311",
                "n.，新书，求收藏！求推荐！",
                "说完，许光拉着许氏离开了许紫烟的房间，去收拾东西，许紫烟望着两位老人突然间明显佝偻的后背，心中一阵感动，已经完全接受了这一世的爹娘，只是心里对未来也充满了惊惧。",
                57)
        content("72/72302/20764926",
                "悟空看着紫霞离开，这时一旁的金圣宫娘娘又激动又羡慕。“你和紫霞仙子之间的感情真的是太好了，同时我要再次感谢你们救了我。”",
                "天才一秒记住本站地址：.。手机版阅读网址：m.",
                38)
    }

}