package cc.aoeiuv020.panovel.api.site

import org.junit.Test

/**
 *
 * Created by AoEiuV020 on 2017.10.11-21:00:18.
 */
class LiudatxtTest : BaseNovelContextText(Liudatxt::class) {
    @Test
    fun search() {
        search("都市")
        search("诸天万界反派聊天群")
    }

    @Test
    fun detail() {
        detail(
                "22921",
                "诸天万界反派聊天群", "不要尬舞",
                "22921",
                "http://www.liudatxt.com/headimgs/22/22921/s22921.jpg",
                "这个穿越画风有些不对？开局就是地狱难度是个什么鬼？还好自带一个金手指。\n" +
                        "从此以后踏上了诸天万界各大反派人生导师的不归路！露出一脸和善微笑的雄霸正指挥着风云怒肛帝释天、" +
                        "海贼世界已经成为一个出色海军的路飞正带着自己的海军攻打四皇、" +
                        "以及把令狐冲当做亲儿子一般的对待满脸正气的岳不群。\n" +
                        "......刘锋叹了一...",
                "2018-04-26T21:42:32.000+0800"

        )
    }

    @Test
    fun chapters() {
        chapters("22921",
                "第1章 穿越到噩梦难度的世界该怎么办？", "22921/8412231", null,
                "第584章 自信的零充", "22921/11561166", "2018-05-21T20:15:40.000+0800",
                610)
    }

    @Test
    fun content() {
        content("22921/8710426",
                "“你是怪物吗？！”这会儿刘锋是真的被面前这个身上血迹斑斑的哥们给惊着了，卧槽，二十多刀刀刀避开要害，简直是人才！",
                "顺带一提，为了避免实力一样引起的怀疑，刘锋稍稍的将刘淼这个账号的实力水平降低了一点设定在二级。",
                37)
    }
}
