package cc.aoeiuv020.panovel.api.site

import org.junit.Test

/**
 * Created by AoEiuV020 on 2018.06.05-19:25:41.
 */
class MiaobigeTest : BaseNovelContextText(Miaobige::class) {
    @Test
    fun search() {
        search("都市")
        search("三寸人间", "耳根", "23704")
        search("放开那个女巫", "二目", "11114")
    }

    @Test
    fun detail() {
        detail("23704", "23704", "三寸人间", "耳根",
                "https://img.miaobige.com/bookpic/s23704.jpg",
                "举头三尺无神明，掌心三寸是人间。这是耳根继《仙逆》《求魔》《我欲封天》《一念永恒》后，创作的第五部长篇小说《三寸人间》。......",
                "2018-06-05 18:12:11")
        detail("11114", "11114", "放开那个女巫", "二目",
                "https://img.miaobige.com/bookpic/s11114.jpg",
                "程岩原以为穿越到了欧洲中世纪，成为了一位光荣的王子。但这世界似乎跟自己想的不太一样？女巫真实存在，而且还真具有魔力？\n" +
                        "女巫种田文，将种田进行到底。......",
                "2018-06-04 23:35:39")
    }

    @Test
    fun chapters() {
        chapters("23704", "写在连载前", "23704/13725850", null,
                "第十三章 化清丹", "23704/13733052", "2018-06-05 18:12:11",
                516)
        chapters("11114", "第一章 从今天开始做王子", "11114/5031906", null,
                "第一千一百四十九章 苍穹下的挑战者", "11114/13705709", "2018-06-04 23:35:39",
                515)
    }

    @Test
    fun content() {
        content("23704/13725850",
                "亲爱的读者大大们，说心里话，我现在心里既激动，又难过。",
                "再喊一句，求收藏啊！！！！减肥秘诀换收藏！！！！！",
                38)
        content("11114/13705709",
                "当太阳一点点隐没于群山峻岭之间，整个平原都染上了一层红霞。",
                "书友分享了两张夜莺的人物图，赞爆了，亲们快去速度围观吧，微信搜索公众号“二目小小”，查看历史消息即可看到哦O（∩_∩）O",
                38)
    }

}