package cc.aoeiuv020.panovel.api.site

import org.junit.Test

/**
 *
 * Created by AoEiuV020 on 2018.03.14-02:19:11.
 */
class N123duTest : BaseNovelContextText(N123du::class) {
    @Test
    fun search() {
        // 搜索还是可能失败，
        search("都市")
        search("柯南之我就是不务正业", "歇会再来", "40/705684")
    }

    @Test
    fun detail() {
        detail("40/705684", "40/705684", "柯南之我就是不务正业", "歇会再来",
                "https://www.123ds.org/bookface/3/152173.jpg",
                "实时提供柯南之我就是不务正业最新章节免费阅读，歇会再来的最新著作柯南之我就是不务正业是一本非常优秀的灵异小说类小说,欢迎爱好的读者来阅读,如你喜欢这本小说，那么请将它加入收藏方便下次阅读。123读书网的爱好者将会第一时间分享更新最新的内容。\n" +
                        "（就算跟主线有偏差也按作者写的为主）陈百成：“我是一个莫得感情地杀手。”众人：“你是啥？”“杀手。”“你告诉我你这一个星期都干了什么？”“也就破了一个案子、救了一个小孩、拍了一部电影……”“……”“我真的是杀手！”“滚！”",
                "2020-12-12 18:59:53")
    }

    @Test
    fun chapters() {
        // 这网站章节标题随机错误，12，意外4的意外
        chapters("40/705684",
                "1，交换生陈百成", "40/705684/36287633", null,
                "141，KTV杀人事件（进行中）", "40/705684/41483404", "2020-12-12 18:59:53",
                141)
    }

    @Test
    fun content() {
        // 文字不倒序，有p，
        content("40/705684/36287633",
                "“你是组织的最后的杀手了，我们决定打开次元壁，让你进行特训。”",
                "陈百成下了车，没让宫本家的小两口陪同，自己进入了学校，这种转学手续还需要人陪就太丢了。…。",
                40)
    }

    @Test
    fun contentReversed() {
        // 文字倒序，没有p,
        content("40/705684/41483404",
                "\"",
                "如果你还没注册会员就先注册个会员吧，使用书架书签更方便哦。",
                11)
    }

    @Test
    fun contentReversedP() {
        // 文字倒序，有p,
        content("34/238403/17427794",
                "?ABO，非常小众的一个题材。",
                "??。",
                39)
    }
}
