package cc.aoeiuv020.panovel.api.site

import org.junit.Test

/**
 * Created by AoEiuV020 on 2018.06.08-19:34:43.
 */
class N52ranwenTest : BaseNovelContextText(N52ranwen::class) {
    init {
        enabled = false
    }
    @Test
    fun search() {
        search("都市")
        search("超级黄金眼", "永远天涯", "1")
        search("傲世战尊", "夜梦寒", "12")
    }

    @Test
    fun detail() {
        detail("1", "1", "超级黄金眼", "永远天涯",
                "https://ranwen.oss-us-west-1.aliyuncs.com/cover/0/1/1s.jpg",
                "当他第一次睁开那只黄金眼的时候，他的亲生父母将其当做怪物而抛弃。" +
                        "当他再次睁开那只黄金眼的时候，王雄发现了那只眼睛奇特的作用。" +
                        "从此以后，他的传奇人生开始了。官场，情场都是春风得意。" +
                        "本故事纯属虚构。如有雷同，纯属巧合。",
                "2013-11-12 21:24:00")
        detail("12", "12", "傲世战尊", "夜梦寒",
                "https://ranwen.oss-us-west-1.aliyuncs.com/cover/0/12/12s.jpg",
                "少年唐傲，因为天生没有气根，一出生就被判定一辈子也不能修炼。" +
                        "于是在这个实力为尊的世界，他被视之为废物，受尽了世人的白眼。" +
                        "但一个玉坠改变了他的命运，神秘强者甘心化身给他当气根，并传授他无上神功仙身至尊诀。" +
                        "为了生存，为了救父，他悍然的开始了顺者昌逆者亡的逆天之途…………",
                "2013-03-06 15:37:00")
    }

    @Test
    fun chapters() {
        chapters("1", "1 第一章 见义勇为", "0/1/2", null,
                "第一百四十四章 你还不够资格", "0/1/5764342", null,
                997)
        chapters("12", "第0001章 雪天求救", "0/12/4453", null,
                "【404】林可人做的！", "0/12/3618701", null,
                641)
    }

    @Test
    fun content() {
        content("0/1/2",
                "“又失败了。”王雄不禁的摇了摇头，来到这个城市已经将近两个月了，可是还是没有找到一份体面的工作，" +
                        "平时的时候只能打打零工，连最基本的生活费都赚不到，而身上本来带的钱也快花光了。",
                "“快跑，这家伙有家伙。”看到这个情况。想从后面袭击王雄的那两个人，还有那个手臂上不断流着血的那个人，" +
                        "以及刚刚从那石头底下艰难的爬出来的两个人，都是使出了全力，朝着两个方向跑去。一瞬间，就消失了个无影无踪。",
                23)
        content("0/12/4453",
                "天，飘雪，轻轻的洒落。",
                "“五总管，给他十两银子，打发他走吧！”突然，轿子里似乎是一声淡淡的叹息，然后，脆甜却又透着无情的声音传出来。",
                55)
        content("0/12/3618701",
                "(ะก",
                "(ะก",
                1)
    }

}