package cc.aoeiuv020.panovel.api.site

import org.junit.Test

class N69shuTest : BaseNovelContextText(N69shu::class) {
    @Test
    fun search() {
        search("都市")
        search("都市修真医圣", "漂浮的气球2", "23895")
        search("柯南里的捡尸人", "仙舟", "35934")
    }

    @Test
    fun detail() {
        detail(
            "23895", "23895", "都市修真医圣", "漂浮的气球2",
            "https://cdn.shucdn.com/files/article/image/23/23895/23895s.jpg",
            "道法通神、医法通鬼。\n一位本应为了生计而狼藉奔波的三流大学毕业生，却因为一次不经意间的出手救人，否极泰来、令他好人有好报的得到了传说中修真界高人的玄术与医道传承，开启了另一个崭新且光怪陆离的新世界！\nps：本书书友qq群：144958878",
            "2021-07-15 00:00:00"
        )
        detail(
            "35934", "35934", "柯南里的捡尸人", "仙舟",
            "https://cdn.shucdn.com/files/article/image/35/35934/35934s.jpg",
            "【马甲流，半无敌，柯南同人】\n对主角的采访：\nQ1：请问您成为黑衣组织王牌鲨手的秘诀是？\n江夏：“带上柯南去目标家里转一圈。”\n.\nQ2：请问您屡次追回被基德盗走的宝物的秘诀是？\n江夏：“他同伙是我马甲。”\n.\n对柯学世界侦探们的采访：\nQ1：如何看待江夏\n侦探们：“除了破案太快＋打起人来拉不住，没有其他缺点。”\n.\nQ2：同为高中生侦探，为什么不联合江夏一起对抗黑衣组织？\n侦探们（匆忙摆手）：“不不不，不能告诉他，世界的暗面对他来说实在太沉重了。”",
            "2021-07-15 00:00:00"
        )
    }

    @Test
    fun chapters() {
        chapters(
            "23895", "1.第1章 失恋了", "23895/13806533", null,
            "4011.第4011章 尸骸遗言，天大收获！", "23895/26014158", null,
            4011
        )
        chapters(
            "35934", "第1章 你不要多想", "35934/25197205", null,
            "第411章 组织黑名单", "35934/26013677", null,
            411
        )
    }

    @Test
    fun content() {
        content(
            "23895/26014158",
            "第4011章",
            "(本章完)",
            73
        )
        content(
            "35934/26013677",
            "第411章",
            "(本章完)",
            73
        )
    }

}