package cc.aoeiuv020.panovel.api.site

import org.junit.Test

/**
 * Created by AoEiuV020 on 2018.06.04-17:29:08.
 */
class N73xsTest : BaseNovelContextText(N73xs::class) {
    @Test
    fun search() {
        search("都市")
        search("一念永恒", "耳根", "32252")
        search("天下第一医馆", "贵族丑丑", "52970")
    }

    @Test
    fun detail() {
        detail("32252", "32252", "一念永恒", "耳根",
                "http://www.73wxw.com/files/article/image/32/32252/32252s.jpg",
                "《一念永恒》是著名网络作家耳根继《我欲封天》之后第四本网络仿古仙侠小说，" +
                        "本书主要以时间线索贯穿全文，讲述白家后人白小纯寻仙问道的艰难之旅，" +
                        "最终一念成沧海，一念化桑田，一念斩千魔，一念诛万仙。唯我念……永恒",
                null)
        detail("52970", "52970", "天下第一医馆", "贵族丑丑",
                "http://www.73wxw.com/files/article/image/52/52970/52970s.jpg",
                "一睁眼，便是人命如草芥的乱世芳华。" +
                        "墨白是个大夫，但他还来不及去想治世救人，他首先要考虑的是如何在三天后不死。" +
                        "然后还得考虑怎样才能见一见那已经和自己成过亲，拜过堂，据说国色天香的老婆？" +
                        "最后，他还得想个能在乱世之中活下来的谋生之道，他决定了，就干老本行，很快，乱世之中，" +
                        "战火最猛烈的中心地带，一间医馆开张了。名字还算低调，曰：“天下第一医馆”",
                null)
    }

    @Test
    fun chapters() {
        chapters("32252", "外传1 柯父。", "32/32252/8967417", null,
                "第1314章 你的选择（终）", "32/32252/27954667", null,
                1455)
        chapters("52970", "第1章 洞房前被打死的明王", "52/52970/13462170", null,
                "第448章 你辩才无双", "52/52970/33072895", null,
                1239)
    }

    @Test
    fun content() {
        content("32/32252/8967417",
                "微风吹过，远处的天空，夕阳的一缕红霞，似乎将苍穹分开成为了两部分，余晖中，整个大地成为了橘黄色，将那一片又一片的麦穗，映照成为了橘色的海浪。",
                "“我感觉到了，你舅舅，他来了……”柯云海笑了。",
                40)
        content("52/52970/33072895",
                "还用问吗？",
                "墨白语气依然清淡：“忠孝也就罢了，我很好奇，你怎还敢说仁义？" +
                        "圣祖爷起事，二十年间，的确十室九空，尸浮遍野，家家戴孝。" +
                        "但死难者，皆乃乃为民族传承之大计而战，便是死难者如此之众，" +
                        "民间仍自不悔，但凡家中有子，老父母依然自备干粮送其上战场。" +
                        "你家有兵数十万，之前不说，却不知旗蛮入侵以来，你家如此之众兵马又斩了几个旗蛮人头？" +
                        "如此也就罢了，反而还在掣肘国朝杀敌，礼官言尔南军，为外敌张目，此言正是再恰当不过，" +
                        "你居然还敢大言不惭，在这圣祖爷威压四海的金殿之上，拿圣祖爷的盖世功绩，来与你家主公相提并论？”",
                67)
    }

}