package cc.aoeiuv020.panovel.api.site

import org.junit.Test

/**
 * 起点测试，因为起点删了不少书，有些测试失效就直接删除了，导致测试有点少，
 * Created by AoEiuV020 on 2017.10.16-17:47:33.
 */
class QidianTest : BaseNovelContextText(Qidian::class) {
    @Test
    fun search() {
        search("都市")
/* // 起点删书严重，
        search("从前有座灵剑山", "国王陛下", "3347574")
        search("斗破苍穹", "天蚕土豆", "1209977")
*/
        search("修真聊天群（聊天群的日常生活）", "圣骑士的传说", "3602691")
    }

    @Test
    fun detail() {
        detail("3602691", "3602691", "修真聊天群（聊天群的日常生活）", "圣骑士的传说",
                "https://bookcover.yuewen.com/qdbimg/349573/3602691/300",
                "某天，宋书航意外加入了一个仙侠中二病资深患者的交流群，里面的群友们都以‘道友’相称，群名片都是各种府主、洞主、真人、天师。" +
                        "连群主走失的宠物犬都称为大妖犬离家出走。整天聊的是炼丹、闯秘境、炼功经验啥的。\n" +
                        "突然有一天，潜水良久的他突然发现……群里每一个群员，竟然全部是修真者，能移山倒海、长生千年的那种！\n" +
                        "啊啊啊啊，世界观在一夜间彻底崩碎啦！\n" +
                        "书友群：九洲1号群:207572656\n" +
                        "九洲２号群:168114177\n" +
                        "九洲３号群:165210665（新）\n" +
                        "九洲一号群（VIP书友群，需验证）63769632",
                null)
        // 小作者的小说详情页作者名不可点击，之前的规则不行，
    }

    @Test
    fun chapters() {
        chapters("3602691",
                "封推感言", "3602691/92831099", "2016-01-17 23:09:00",
                "第1941章 乱了，彻底乱了", "3602691/407005799", "2018-05-20 18:50:00",
            1950)
        // 这个章节列表体积大于默认1M，
        chapters("3357187",
                "第1章 撕心裂肺的背叛", "3357187/70794726", "2014-05-13 04:40:00",
                "五月份~~", "3357187/405405025", "2018-05-01 00:02:00",
                10298)
    }

    @Test
    fun content() {
        content("3602691/87926246",
                "2019年5月20日，星期一。",
                "是误加吗？",
                98)
        content("3602691/89970621",
                "要不要回拨个电话给客服，问问是究竟是怎么回事？毕竟是一千万的金额！",
                "宋书航点开‘九...",
                4)
    }
}
