package cc.aoeiuv020.panovel.api.site

import org.junit.Test

/**
 * Created by AoEiuV020 on 2018.06.07-14:03:25.
 */
class ShangshuTest : BaseNovelContextText(Shangshu::class) {
    @Test
    fun search() {
        search("都市")
        search("仲夏夜的秘密", "安知晓", "15/15043")
        search("蚀骨危情", "淇老游", "88/88425")
    }

    @Test
    fun detail() {
        detail("15/15043", "15/15043", "仲夏夜的秘密", "安知晓",
                "http://www.shangshu.cc/files/article/image/15/15043/15043s.jpg",
                "仲夏夜的秘密的简介：乔东林对顾玥一见钟情，不到一个月，两人领了结婚证，她选择了没有爱情的婚姻。" +
                        "在仲夏里，一场盛世婚礼展开了序幕，结婚前，乔东林说，“顾玥，你放心，嫁给我，你肯定不会后悔！”\n" +
                        "顾玥心想，你一定会后悔！结婚后，顾玥步步为营，化解婚姻中的危机，他本以为事业爱情两得意，却发现枕边是触不到的爱人……",
                null)
        detail("88/88425", "88/88425", "蚀骨危情", "淇老游",
                "http://www.shangshu.cc/files/article/image/88/88425/88425s.jpg",
                "夏薇茗死了，沈修瑾亲手将简童送进了女子监狱。\n" +
                        "三年牢狱，简童被沈修瑾一句“好好关照她”折磨的大变样，甚至狱中“被同意捐肾”。\n" +
                        "入狱前，简童说：我没杀她。沈修瑾不为所动。\n" +
                        "出狱后，简童说：我杀了夏薇茗，我有罪。\n" +
                        "沈修瑾铁青着脸：你给我闭嘴！不要再让我听到这句话！\n" +
                        "简童笑了：真的，我杀了夏薇茗，我坐了三年牢。\n" +
                        "简童逃了，沈修瑾找疯了满世界通缉她。\n" +
                        "沈修瑾说：简童，我把肾给你，你把心给我吧。\n" +
                        "简童仰头看向沈修瑾，说……",
                null)
    }

    @Test
    fun chapters() {
        chapters("15/15043", "001 闪婚了", "15/15043/5299194", null,
                "老婆，再结嫁我一次 （大结局）", "15/15043/7292866", null,
                97)
        chapters("88/88425", "第一章 送她进监狱", "88/88425/35449055", null,
                "第三百零七章 哪个才是真正的他", "88/88425/48365260", null,
                307)
    }

    @Test
    fun content() {
        content("15/15043/5299194",
                "结婚前，乔东林说，“顾玥，你放心，嫁给我，你肯定不会后悔！”",
                "顾玥见他们都审视般看着她，她微笑说，“你们好，我叫顾玥。”",
                21)
        content("88/88425/48365260",
                "，精彩小说无弹窗免费阅读！",
                "她竟然……紧张到出汗？",
                66)
    }

}