package cc.aoeiuv020.panovel.api.site

import org.junit.Test

/**
 * Created by AoEiuV020 on 2018.06.08-19:09:47.
 */
class Shu8Test : BaseNovelContextText(Shu8::class) {
    @Test
    fun search() {
        search("都市")
        search("独家占有：穆先生，宠不停！", "公子如雪", "26/26271")
        search("快穿之男神攻略守则", "卓尔凡凡", "26/26231")
    }

    @Test
    fun detail() {
        detail("26/26271", "26/26271", "独家占有：穆先生，宠不停！", "公子如雪",
                "https://88xs.us/files/article/image/26/26271/26271s.jpg",
                "入夜，再一次被男人丢到床上，她终于抓狂，" +
                        "“说好不同床的！”男人抬手扯开领带，一脸得狂傲霸道，" +
                        "“没有你，我睡不着！”他是高冷薄情，说一不二的穆阎王，一向视女人为粪土，却唯独对她宠之入骨。" +
                        "初时，他霸道嚣张——“连你都是我的！”随后，他渐渐沦陷——“我的就是你的！”" +
                        "最后，他乖乖投降——“宁小菲，我也是你的！”【宁小",
                null)
        detail("26/26231", "26/26231", "快穿之男神攻略守则", "卓尔凡凡",
                "https://88xs.us/files/article/image/26/26231/26231s.jpg",
                "魂魄离开身体那一刻，叶笑笑才知道自己这辈子真的爱错了。可是世界上有后悔药吗？" +
                        "有！“滴——生存意念程度符合！”“滴——正在读取脑电波！”“滴——正在检测要求是否符合！”" +
                        "“滴——要求符合，正在侵入脑电波！”“宿主您好，我是A级攻略系统cc，" +
                        "帮助宿主完成全部寄体心愿，宿主即可获得重生机会，接下来的日子预祝我们合作愉快！”" +
                        "从此以后，叶笑笑走上一条攻略男主不归路，混血小叔叔-冷酷校草-霸道总裁-暖男竹马-伯爵吸血鬼-呆萌小侍卫！" +
                        "男神排排站！向我看过来！",
                null)
    }

    @Test
    fun chapters() {
        // 这网站章节列表最后一章可能名字有错莫名不好处理，
        chapters("26/26271", "第1413章 超级奶爸全文完", "26/26271/20045286", null,
                "第1413章 超级文奶爸全文完", "26/26271/20045286", null,
                1421)
        chapters("26/26231", "第866章 大结局", "26/26231/18084222", null,
                "第8 66章 大结局", "26/26231/18084222", null,
                813)
    }

    @Test
    fun content() {
        content("26/26271/8757613",
                "宁小菲被助理塞进车子的时候，后座上的男人正专心地注视着电脑屏幕，防幅射眼镜片映着屏幕上的股市报表，镜片后的墨眸连斜都没有向她斜上哪怕一下。",
                "新年新书新气象，求爱求包养",
                29)
        content("26/26231/18084222",
                "没了沐宇珩，叶笑笑只觉得上课都好没劲，上了几天便翘课了。",
                "——本文完———",
                69)
    }

}