package cc.aoeiuv020.panovel.api.site

import org.junit.Test

class Wukong0Test : BaseNovelContextText(Wukong0::class) {
    @Test
    fun search() {
        search("都市")
        search("都市之最强战龙", "赵东苏菲", "127717")
        search("术师手册", "听日", "128827")
    }

    @Test
    fun detail() {
        detail(
            "127717", "127717", "都市之最强战龙", "赵东苏菲",
            "https://www.wkxs.net/files/article/image/127/127637/127637s.jpg",
            "枪林弹雨中归来，赵东成为了高档小区的夜班保安。他原本只想过平凡的生活，奈何那一晚送宿醉的女业主回家，平凡的生活再起波澜……\n既然不能随波逐流，那就只能覆海移山，潜龙升天！\n书友群：175925979",
            "2022-03-23 22:24:00"
        )
        detail(
            "128827", "128827", "术师手册", "听日",
            "https://www.wkxs.net/files/article/image/128/128747/128747s.jpg",
            "1668年，我所在的城市被评为全国治安最好的地区。\n我对此做出了不可磨灭的贡献。\n因为我落网了。",
            "2022-03-05 12:46:00"
        )
    }

    @Test
    fun chapters() {
        chapters(
            "127717", "第1章 女神的床", "127717/50789828", null,
            "第2263章 一个选择", "127717/59479682", "2022-03-23 22:24:00",
            2264
        )
        chapters(
            "128827", "第1章 我被逮捕了", "128827/57371600", null,
            "第590章 不伤害别人就没办法活下去", "128827/59086616", "2022-03-05 12:46:00",
            606
        )
    }

    @Test
    fun content() {
        content(
            "127717/59479682",
            "悟空小说网",
            "说到这里，蔡琳眼里闪过一道寒芒，“田秋雨，给我一个答案！”",
            84
        )
        content(
            "128827/59086616",
            "悟空小说网",
            "内容更新后，请重新刷新页面，即可获取最新更新！",
            12
        )
    }

}