package cc.aoeiuv020.panovel.api.site

import org.junit.Test

/**
 * Created by AoEiuV020 on 2018.06.08-18:03:24.
 */
class X23usTest : BaseNovelContextText(X23us::class) {
    @Test
    fun search() {
        search("都市")
        search("帝霸", "厌笔萧生", "64889")
        search("穿越之变身绝色女主角", "饥饿的蚊子", "67339")
    }

    @Test
    fun detail() {
        detail("64889", "64889", "帝霸", "厌笔萧生",
                "https://www.x23us.com/files/article/image/64/64889/64889s.jpg",
                "天若逆我，我必封之，神若挡我，我必屠之——站在万族之巅的李七夜立下豪言！\n" +
                        "这是属于一个平凡小子崛起的故事，一个牧童走向万族之巅的征程。\n" +
                        "在这里充满神话与奇迹，天魔建起古国，石人筑就天城，鬼族铺成仙路，魅灵修补神府……",
                "2018-06-08 00:00:00")
        detail("67339", "67339", "穿越之变身绝色女主角", "饥饿的蚊子",
                "https://www.x23us.com/modules/article/images/nocover.jpg",
                "消炎每天最怕的就是醒来，因为睡醒之后他不知道自己又将变成那部影视动漫作品里的绝色女主角…\n" +
                        "还记得第一次变身是《神雕侠侣》里的小龙女\n" +
                        "各位书友要是觉得《穿越之变身绝色女主角》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！穿越之变身绝色女主角最新章节,穿越之变身绝色女主角无弹窗,穿越之变身绝色女主角全文阅读.",
                "2018-06-08 00:00:00")
    }

    @Test
    fun chapters() {
        chapters("64889", "契子（读者必看 非常重要）", "64/64889/26487455", null,
                "第3196章大开杀戒", "64/64889/31148918", "2018-06-08 00:00:00",
                3223)
        chapters("67339", "第1章 穿越变身小龙女", "67/67339/28019700", null,
                "第1458章 小樱分身赶来", "67/67339/31160069", "2018-06-08 00:00:00",
                1486)
    }

    @Test
    fun content() {
        content("64/64889/26487455",
                "契子",
                "一只不甘命运被左右的乌鸦，对抗着天地最可怕的存在，左右着千万年中的一个又一个大时代的变迁！",
                24)
        content("67/67339/31160069",
                "和原剧有些一样，阿飞将尾兽重新封印到人柱力体内，这一刻，6大人柱力同时尾兽化，恐怖的能力骇人。顶点小说 Ｘ２３ＵＳ．ＣＯＭ更新最快",
                "因为阿飞看到这个春野樱不光气质比较邪魅，更为不同的是，她的右眼竟然是一颗轮回眼",
                32)
    }

}