package cc.aoeiuv020.panovel.api.site

import org.junit.Test

/**
 * Created by AoEiuV020 on 2020.03.28-23:30:33.
 */
class YunduwuTest : BaseNovelContextText(Yunduwu::class) {
    @Test
    fun search() {
        search("书")
        search("曾国藩家书", "曾国藩", "607")
    }

    @Test
    fun detail() {
        detail("607", "607", "曾国藩家书", "曾国藩",
                "https://www.yunduwu.com/upload/novel/20191116/157387546035259.jpg",
                "愚于近人，独服曾文正，观其收拾洪杨一役，完满无缺。使以今人易其位，其能如彼之完满乎？\n" +
                        "——毛泽东1917年8月23日致黎锦熙\n" +
                        "何兆武说：“中国历史上真正能够做到立德，立功，立言的只有二人：王阳明，曾国藩。”\n" +
                        "曾国藩是中国近代史上权位显赫、作用极大、很有影响的人物，又是一个复杂的人物，近代中国人尤其湖南人，从权贵政要、志士仁人到青年学子，大多佩服曾国藩，佩服其治学为人和带兵做事。从李鸿章、张之洞到袁世凯、蒋介石，无不对他顶礼膜拜，尊为“圣哲”；从梁启超到杨昌济，从陈独秀到毛泽东，也无不表示过推崇其师法，受过其人的种种影响。",
                "2019-11-16 11:47:26")
    }

    @Test
    fun chapters() {
        chapters("607", "前言", "607/3576", null,
                "同治十年十月二十三日", "607/3631", null,
                56)
    }

    @Test
    fun content() {
        content("607/3631",
                "澄、沅两弟左右：",
                "为兄在外两个多月，应酬太过繁忙，眩晕和疝气等毛病幸好没有复发，脚肿的毛病也好了。只是老眼昏花，一天比一天厉害；小便也太过频繁。衰弱和年老逼人，是当然之理，不值为怪。",
                21)
    }
}