package cc.aoeiuv020.panovel.api.site

import org.junit.Test

/**
 * Created by AoEiuV020 on 2018.06.08-18:31:29.
 */
class ZhuishuTest : BaseNovelContextText(Zhuishu::class) {
    @Test
    fun search() {
        search("都市")
        search("圣武星辰", "乱世狂刀", "56867")
        search("霸武神王", "乌山云雨", "58054")
    }

    @Test
    fun detail() {
        detail("56867", "56867", "圣武星辰", "乱世狂刀",
                "https://www.bimo.cc/cover/56/56867.jpg",
                "事情是这样的，2017年夏天，在太阳系之外，位于紫薇星域的几大超级武道宗门，" +
                        "要修筑一座史无前例的大型传送阵法，以方便他们对于银河系南部星域的开发，" +
                        "而这座阵法的仙力脉冲正好要经过地球，所以，地球要被强拆了。\n" +
                        "而地球人对此，一无所知。",
                "2018-06-07 19:40:02")
        detail("58054", "58054", "霸武神王", "乌山云雨",
                "https://www.bimo.cc/cover/58/58054.jpg",
                "快递小哥叶枫获得公司奖励的一部最新款菠萝X型号手机时，意外穿越异世，开启神秘系统，化身英俊潇洒小镖师，且看他——\n" +
                        "脚踢九天仙王，拳打幽冥魔君！\n" +
                        "天上地下，唯我独尊！\n" +
                        "天仙圣女，魅惑妖精，弱水三千争相伴！\n" +
                        "纵横三界，穿梭九域，天地广大任我行！",
                "2018-01-28 10:53:51")
    }

    @Test
    fun chapters() {
        chapters("56867", "新书感言", "56867/292770", null,
                "0676、黯灭天骄王言一", "56867/1181965", "2018-06-07 19:40:02",
                723)
        chapters("58054", "第1章 叶枫", "58054/8371", null,
                "第215章 新的开始（全书完）", "58054/200787", "2018-01-28 10:53:51",
                215)
    }

    @Test
    fun content() {
        content("56867/292770",
                "又又又又又要开新书了。",
                "兄弟姐妹们，来吧，让我们一起，再出发。",
                39)
        content("58054/200787",
                "噗！",
                "而这，仅仅不过是一个新的开始……",
                156)
    }

}